Revit 2027 API
BuiltInFailures.SketchFailures.InvalidSketchForToposolid Property
 Toposolid sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSketchForToposolid { get; }
Public Shared ReadOnly Property InvalidSketchForToposolid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSketchForToposolid {
	FailureDefinitionId^ get ();
}
static member InvalidSketchForToposolid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace